# Выведите слово "Hello" 5 раз

a = "Hello"

i = 1
while i <= 5:
    print("Hello")
    i = i + 1
