# Выведите слово "Hello" 5 раз
a = "Hello"

for i in range(5):
    print(a)
