# Дан массив nums длины n
# Создать массив ans длины 2n такой что: ans[i] = nums[i], ans[i + n] = nums[i]

# Пример: nums = [1, 2, 3], ans = [1, 2, 3, 1, 2, 3]

nums = list(map(int, input().split(" ")))
print(nums)
