# На основе предыдущего решения
# Вычислите D = b^2 - 4ac, выведите D
a = int(input())
b = int(input())
c = int(input())
result = a+b-c
d = b*b-4*a*c
print(d)
